src/cf/Catalogs/fmBudgetingScenarios.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmBudgetingScenarios</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>PlanningPeriod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmPlanningPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PlanningPeriodicity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmPlanningPeriodicity</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScenarioType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetingScenarioTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetingCurrencyRates</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmBudgetingScenarioTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetingScenarioTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Plan</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fact</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/fmPlanningPeriodicity.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmPlanningPeriodicity</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Month</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Quarter</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/fmPlanningPeriod.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmPlanningPeriod</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Year</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Quarter</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmBudgetingScenarios/Ext/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then
Procedure FillPredefinedValues() Export
	
	FactObject = Catalogs.fmBudgetingScenarios.Plan.GetObject();
	FactObject.ScenarioType = Enums.fmBudgetingScenarioTypes.Plan;
	FactObject.PlanningPeriodicity = Enums.fmPlanningPeriodicity.Month;
	FactObject.PlanningPeriod = Enums.fmPlanningPeriod.Year;
	FactObject.Write();

	PlanObject = Catalogs.fmBudgetingScenarios.Actual.GetObject();
	PlanObject.ScenarioType = Enums.fmBudgetingScenarioTypes.Fact;
	PlanObject.PlanningPeriodicity = Enums.fmPlanningPeriodicity.Month;
	PlanObject.PlanningPeriod = Enums.fmPlanningPeriod.Year;
	PlanObject.Write();
	
EndProcedure
#EndIf
